[
	{
		"startMonth": 1,
		"startYear": 2024,
		"endMonth": "now",
		"endYear": "2024",
		"projects": [],
		"title": "Architectural Designer & Historical Preservationist",
		"team": "Restoration Sabbatical",
		"company": "Mesta-Martin House",
		"location": "",
		"points": [
			"Applied systems thinking, woodworking skills, architectural knowledge, and historical research to plan and execute full restoration of former State Representative's house, built c1898.",
			"Researched house history extensively; utilized buildings archaeology to find previous renovation evidence; documented with floor plans, elevations, and photography.",
			"Cataloged doorknobs, doors, millwork, windows, corners, locks, archways, and floorings; identified repeating architectural motifs, and composed new complementary millwork profiles.",
			"Finalized window, door, millwork, cabinetry, and electrical plans for 18 rooms, 3 bathrooms, 2 staircases, 2 pantries, and 3 porches. 47 restoration projects nearing or at completion."
		]
	},
	{
		"startMonth": 5,
		"startYear": 2023,
		"endMonth": 12,
		"endYear": 2023,
		"lead": false,
		"advisor": true,
		"role": [
			"Architect",
			"UX Designer",
			"Writer"
		],
		"title": "Senior UX Designer & Content Strategy Consultant",
		"team": "",
		"company": "Bast AI",
		"points": [
			"Defined branding, digital design, and user interactions across platforms; partnered with developers on implementation.",
			"Conducted market research, collaborated on marketing/pitch materials and content.",
			"Created sharable long-form content to raise brand awareness; conceptualized 7 product applications.",
			"Wrote and edited 11 investor decks and presentations."
		]
	},
	{
		"startMonth": 6,
		"startYear": 2023,
		"endMonth": 4,
		"endYear": 2023,
		"lead": true,
		"advisor": false,
		"role": [
			"Architect",
			"Fullstack Developer",
			"Dataviz Designer"
		],
		"title": "Design System Architect & Development Lead",
		"team": "Digital Marketing",
		"company": "Kyndryl",
		"points": [
			"Led a global development team in continuous improvement on public site; established team processes and standards.",
			"Architected the design system and implementation processes, and strategized future expansion.",
			"Outlined design system documentation with 11 sections and 45 components.",
			"Educated colleagues on dataviz design standards and best practices; presented 6-part Dataviz Principles sessions for UX Guild's 200+ audience."
		]
	},
	{
		"startMonth": 11,
		"startYear": 2021,
		"endMonth": 6,
		"endYear": 2022,
		"lead": true,
		"advisor": true,
		"role": [
			"Dataviz Designer",
			"Architect",
			"Fullstack Developer",
			"UX Designer"
		],
		"title": "Data Visualization Design Lead & Principal UX/UI Developer",
		"team": "People Analytics",
		"company": "Kyndryl",
		"points": [
			"Led team design initiatives and established HR data visualization brand and standards; gave 5 Brand vs Data in Visualization presentations to interested company divisions and company leaders.",
			"Clarified dataviz best practices in PowerBI and trained 17 Data Scientists on use in the application.",
			"Founded the Dataviz Design Guild; mentored designers, developers, and managers globally in dataviz best practices.",
			"Upgraded authentication process; created HR-specific authorization with administrative controls.",
			"Continuously improved dynamic Vue3 analytics site for HR representatives, with 2K+ weekly visits."
		]
	},
	{
		"startMonth": 6,
		"startYear": 2020,
		"endMonth": 10,
		"endYear": 2021,
		"title": "Data Visualization Design Lead & Principal UX/UI Developer",
		"team": "HR Analytics",
		"company": "IBM",
		"points": [
			"Supported and promoted HR Analytics site growth to a height of 8K+ (internal HR) visits weekly.",
			"Steered HR dataviz style in conjunction with Data Science Guild; participated in monthly cross-functional design system efforts, advising on company design system dataviz components.",
			"Founded HR Dataviz Guild; hosted 11 guild best practice interviews and 15 ‘open office’ hours for mentoring data scientists in design.",
			"Expanded MongoDB/NoSQL backend to include complex site administration; built and maintained Vue3 analytics site personalization and faceted search."
		],
		"lead": true,
		"advisor": true,
		"role": [
			"Architect",
			"Fullstack Developer",
			"Dataviz Designer",
			"UX Designer"
		]
	},
	{
		"startMonth": 7,
		"startYear": 2018,
		"endMonth": 6,
		"endYear": 2020,
		"title": "Development Lead & Data Visualization Designer",
		"team": "Talent Transformation Analytics",
		"company": "IBM",
		"points": [
			"Designed data visualizations for intuitive analysis and management of 100K+ training candidates.",
			"Expanded and maintained dynamic Vue2 UI to drive data-based decision making; completed regular monthly user interviews to gain user insight and feedback on planned and potential changes.",
			"Developed database, authorization, and authentication APIs. Instrumental in achieving 67% increase in analytics automation for 200+ active daily HR and HQ users.",
			"Mentored 5 junior devs in API design and component patterns; instructed 32 data scientists in UX principles with regular presentations and weekly ‘open office’ hours.",
			"Redesigned analytics intake process to manage 50-60 requests per month."
		],
		"lead": true,
		"advisor": true,
		"role": [
			"Architect",
			"Fullstack Developer",
			"Dataviz Designer",
			"UX Designer",
			"UX Researcher"
		]
	},
	{
		"startMonth": 4,
		"startYear": 2017,
		"endMonth": 6,
		"endYear": 2018,
		"title": "UX Strategist & UX Designer",
		"team": "NA Chief Data Office",
		"company": "IBM",
		"points": [
			"Drove the infusion of modern design in data privacy, security, integration, governance, and analytics; organized and facilitated design thinking workshops for CDO team and clients.",
			"Crafted team narrative and accompanying internal marketing site; conducted regular user research to support new and extended team offerings.",
			"Specified design specifications for 16 projects, and supervised task and process analyses for 29 projects.",
			"Initiated and constructed dynamic web application to drive data-based decision making. Prototyped with Git hooks and APIs as temporary data (flat file) storage; used SQL, NoSQL, and MongoDB for production version."
		],
		"lead": true,
		"advisor": false,
		"role": [
			"Design Strategist",
			"UX Researcher",
			"Architect",
			"Fullstack Developer",
			"UX Designer"
		]
	},
	{
		"startMonth": 10,
		"startYear": 2016,
		"endMonth": 3,
		"endYear": 2017,
		"title": "API Developer",
		"team": "Cloud Platform",
		"company": "IBM",
		"points": [
			"Orchestrated partnership between design, backend, and frontend teams to evaluate 50+ API processes.",
			"Consolidated stakeholder input, user feedback, industry standards, and functional requirements, and assessed against issues of scalability, performance, robustness, and security.",
			"Championed streamlined process for designing, documenting, developing, and deploying platform APIs."
		],
		"lead": false,
		"advisor": true,
		"role": [
			"Architect",
			"API Developer",
			"UX Researcher",
			"Presenter",
			"Writer"
		]
	},
	{
		"startMonth": 9,
		"startYear": 2015,
		"endMonth": 9,
		"endYear": 2016,
		"title": "Senior UX/UI Developer",
		"team": "Cloud Platform (Bluemix)",
		"company": "IBM",
		"location": "Austin, TX",
		"points": [
			"Applied enterprise experience for overhaul of legacy system into modern framework; contributed architecture insight to 3 major Cloud products.",
			"Liaisoned between engineers and designers; supervised deliverables and prepared for future iterations.",
			"Developed 20+ app interactions in asynchronous environment; coordinated with designers to solve high friction and low performance points.",
			"Advised product managers and designers on proposed features’ technical feasibility; advocated strongly for accessibility and usability.",
			"Mentored and instructed junior developers on RESTful APIs, microservice technology, architecture, and strategy."
		],
		"lead": false,
		"advisor": true,
		"role": [
			"Frontend Developer",
			"API Developer",
			"Architect"
		]
	},
	{
		"startMonth": 3,
		"startYear": 2015,
		"endMonth": 9,
		"endYear": 2015,
		"projects": [],
		"title": "UX/UI Developer/Architect",
		"team": "",
		"company": "Applango",
		"points": [
			"Spearheaded, crafted, and deployed a more performant modular AngularJS application architecture; identified 3 UX approaches to shift user mental models.",
			"Researched data sources to resolve data limitations and surfaced 4 new data opportunities for an improved user experience.",
			"Assisted backend devs in improving API performance in frontend ingestion; envisioned and implemented advanced filtering."
		],
		"lead": false,
		"advisor": false,
		"role": [
			"Frontend Developer",
			"UX Designer",
			"UX Researcher"
		]
	},
	{
		"startMonth": 6,
		"startYear": 2013,
		"endMonth": 12,
		"endYear": 2014,
		"title": "UX/UI Developer",
		"team": "36,50",
		"company": "Dun & Bradstreet",
		"location": "Austin, TX",
		"points": [
			"Developed greenfield AngularJS enterprise application, implementing performant API approaches for 50+ endpoints.",
			"Facilitated cross-team collaboration between development and design, driving improvements in interaction, responsiveness, and accessibility.",
			"Devised, prototyped, and presented SSO connection from and to the legacy and new platforms, completed in 17 days.",
			"Merged visual elements to visually link old and new applications, and reduced user friction during transition to new application.",
			"Architected mobile-friendly asynchronous web application; advised stakeholders on technical constraints and component feasibility.",
			"Designed, prototyped, tested, and released 7 data visualizations calling multiple APIs and based on complex data sets for better user analysis."
		],
		"lead": true,
		"advisor": true,
		"role": [
			"Frontend Developer",
			"UX Designer"
		]
	}
]
